BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega32U4.PIC
      <edc:DCRDef edc:_addr="0x1" edc:access="nnnnnnnn" edc:cname="HIGH" edc:factorydefault="0x99" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BOOTRST" edc:desc="Boot Reset vector Enabled" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="BOOTSZ" edc:desc="Select Boot Size" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="256W_3F00" edc:desc="Boot Flash size=256 words start address=$3F00" edc:when="(field &amp; 0x3) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="512W_3E00" edc:desc="Boot Flash size=512 words start address=$3E00" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="1024W_3C00" edc:desc="Boot Flash size=1024 words start address=$3C00" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="2048W_3800" edc:desc="Boot Flash size=2048 words start address=$3800" edc:when="(field &amp; 0x3) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EESAVE" edc:desc="Preserve EEPROM through the Chip Erase cycle" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="WDTON" edc:desc="Watchdog timer always on" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="SPIEN" edc:desc="Serial program downloading (SPI) enabled" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Interface Enabled" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="OCDEN" edc:desc="On-Chip Debug Enabled" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x2" edc:access="----nnnn" edc:cname="EXTENDED" edc:factorydefault="0xFB" edc:impl="0xF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BODLEVEL" edc:desc="Brown-out Detector trigger level" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="Brown-out detection disabled; [BODLEVEL=111]" edc:when="(field &amp; 0x7) == 0x07"/>
              <edc:DCRFieldSemantic edc:cname="2V0" edc:desc="Brown-out detection at VCC=2.0 V" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:DCRFieldSemantic edc:cname="2V2" edc:desc="Brown-out detection at VCC=2.2 V" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:DCRFieldSemantic edc:cname="2V4" edc:desc="Brown-out detection at VCC=2.4 V" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:DCRFieldSemantic edc:cname="2V6" edc:desc="Brown-out detection at VCC=2.6 V" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="3V4" edc:desc="Brown-out detection at VCC=3.4 V" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="3V5" edc:desc="Brown-out detection at VCC=3.5 V" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="4V3" edc:desc="Brown-out detection at VCC=4.3 V" edc:when="(field &amp; 0x7) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="HWBE" edc:desc="Hardware Boot Enable" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:FusesSpace>
  <edc:LockbitsSpace edc:magicoffset="0x830000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x1" edc:regionid="LOCKBITS">
      <edc:DCRDef edc:_addr="0x0" edc:access="--nnnnnn" edc:cname="LOCKBIT" edc:factorydefault="0x0" edc:impl="0x3F" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="LB" edc:desc="Memory Lock" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PROG_VER_DISABLED" edc:desc="Further programming and verification disabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="PROG_DISABLED" edc:desc="Further programming disabled" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No memory lock features enabled" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BLB0" edc:desc="Boot Loader Protection Mode" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="LPM_SPM_DISABLE" edc:desc="LPM and SPM prohibited in Application Section" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="LPM_DISABLE" edc:desc="LPM prohibited in Application Section" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="SPM_DISABLE" edc:desc="SPM prohibited in Application Section" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No lock on SPM and LPM in Application Section" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BLB1" edc:desc="Boot Loader Protection Mode" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="LPM_SPM_DISABLE" edc:desc="LPM and SPM prohibited in Boot Section" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="LPM_DISABLE" edc:desc="LPM prohibited in Boot Section" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="SPM_DISABLE" edc:desc="SPM prohibited in Boot Section" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No lock on SPM and LPM in Boot Section" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PE6"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="INT6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P6" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="UVCC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="DM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="DP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="UGND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="UCAP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VBUS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PDI" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PDO" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCC" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RTS" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RESET"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VCC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="XTAL2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="XTAL1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0"/>
      <edc:VirtualPin edc:name="INT0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1"/>
      <edc:VirtualPin edc:name="INT1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2"/>
      <edc:VirtualPin edc:name="INT2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3"/>
      <edc:VirtualPin edc:name="INT3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5"/>
      <edc:VirtualPin edc:name="CTS" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVCC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4"/>
      <edc:VirtualPin edc:name="ADC8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="ICP" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P4" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6"/>
      <edc:VirtualPin edc:name="_OCD" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="ADC9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="T" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7"/>
      <edc:VirtualPin edc:name="ADC10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCD" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="T" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4"/>
      <edc:VirtualPin edc:name="ADC11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT4" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5"/>
      <edc:VirtualPin edc:name="_OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="ADC12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT5" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6"/>
      <edc:VirtualPin edc:name="ADC13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT6" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC6"/>
      <edc:VirtualPin edc:name="_OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P6" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC7"/>
      <edc:VirtualPin edc:name="CLK0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="ICP" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P7" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE2"/>
      <edc:VirtualPin edc:name="HWB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VCC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF7"/>
      <edc:VirtualPin edc:name="ADC7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TDI" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF6"/>
      <edc:VirtualPin edc:name="ADC6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TDO" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF5"/>
      <edc:VirtualPin edc:name="ADC5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TMS" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF4"/>
      <edc:VirtualPin edc:name="ADC4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TCK" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF1"/>
      <edc:VirtualPin edc:name="ADC1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF0"/>
      <edc:VirtualPin edc:name="ADC0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AREF"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVCC"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>